app/controllers/buchungs_controller.rb

  def index
    if params[:mitarbeiter_id]
      @buchungs = Buchung.find_all_by_mitarbeiter_id(params[:mitarbeiter_id])
    else
      @buchungs = Buchung.all
---
SELECT * FROM "buchungs" WHERE ("buchungs"."mitarbeiter_id" = '1') LIMIT 1
SELECT * FROM "buchungs" WHERE ("buchungs".projekt_id = 1)

  def show
    @buchung = Buchung.find(params[:id])
---
SELECT * FROM "buchungs" WHERE ("buchungs"."id" = 1)

  def new
    @projekt = Projekt.find(params[:projekt_id])
---
SELECT * FROM "projekts" WHERE ("projekts"."id" = 1) LIMIT 1

  def create
    @buchung = Buchung.new(params[:buchung])
    @projekt = @buchung.projekt

    respond_to do |format|
      if @buchung.save
---
INSERT INTO "buchungs" ("mitarbeiter_id", "grund", "woche", "jahr", "updated_at", "geleistet", "beschreibung", "delegieren", "gebucht", "bestaetigung", "projekt_id", "menge", "created_at") VALUES(1, NULL, 26, 2009, '2009-06-28 14:48:34', NULL, 'Es gibt viel zu tun!', NULL, 20.0, NULL, 2, NULL, '2009-06-28 14:48:34')

  def update
    @buchung = Buchung.find(params[:id])

    respond_to do |format|
      if @buchung.update_attributes(params[:buchung])
---
SELECT * FROM "buchungs" WHERE ("buchungs"."id" = 1)
UPDATE "buchungs" SET "geleistet" = 20.0, "bestaetigung" = 'alles erledigt!!!', "updated_at" = '2009-06-17 16:22:01' WHERE "id" = 1

  def depute
    @buchung = Buchung.find(params[:id])
---
SELECT * FROM "buchungs" WHERE ("buchungs"."id" = 1)

  def confirm
    @buchung = Buchung.find(params[:id])
---
SELECT * FROM "buchungs" WHERE ("buchungs"."id" = 1)