app/controllers/mitarbeiters_controller.rb

  def index
    @mitarbeiters = Mitarbeiter.all
---
SELECT * FROM "mitarbeiters"

  def show
    @mitarbeiter = Mitarbeiter.find(params[:id])
---
SELECT * FROM "mitarbeiters" WHERE ("mitarbeiters"."id" = 1) LIMIT 1

  def edit
    @mitarbeiter = Mitarbeiter.find(params[:id])
---
SELECT * FROM "mitarbeiters" WHERE ("mitarbeiters"."id" = 1) LIMIT 1

  def auslastung
    @mitarbeiters = Mitarbeiter.find(:all)
---
SELECT * FROM "mitarbeiters" WHERE ("mitarbeiters"."id" = 1) LIMIT 1

  def create
    @mitarbeiter = Mitarbeiter.new(params[:mitarbeiter])

    respond_to do |format|
      if @mitarbeiter.save
---
INSERT INTO "mitarbeiters" ("name", "updated_at", "wochenstunden", "buchung_id", "projekt_id", "created_at") VALUES('Hannes', '2009-06-16 19:14:25', 40.0, NULL, NULL, '2009-06-16 19:14:25')

  def destroy
    @mitarbeiter = Mitarbeiter.find(params[:id])
    @mitarbeiter.destroy
---
SELECT * FROM "mitarbeiters" WHERE ("mitarbeiters"."id" = 5)
DELETE FROM "mitarbeiters" WHERE "id" = 5