app/controllers/projekts_controller.rb

SELECT * FROM "projekts" WHERE ("projekts"."mitarbeiter_id" = '1')
SELECT * FROM "projekts"
---
  def index
    if params[:mitarbeiter_id]
      @projekts = Projekt.find_all_by_mitarbeiter_id(params[:mitarbeiter_id])
    else
      @projekts = Projekt.all

SELECT * FROM "projekts" WHERE ("projekts"."id" = 1) LIMIT 1
SELECT * FROM "mitarbeiters" WHERE ("mitarbeiters"."id" = 1) LIMIT 1
---
  def show
    @projekt = Projekt.find(params[:id])
    if params[:mitarbeiter_id]
      @mitarbeiter = Mitarbeiter.find(params[:mitarbeiter_id])

SELECT * FROM "projekts" WHERE ("projekts"."id" = 1) LIMIT 1
SELECT * FROM "mitarbeiters" WHERE ("mitarbeiters"."id" = 1) LIMIT 1
---
  def edit
    @projekt = Projekt.find(params[:id])
    if params[:mitarbeiter_id]
      @mitarbeiter = Mitarbeiter.find(params[:mitarbeiter_id])

INSERT INTO "projekts" ("mitarbeiter_id", "name", "updated_at", "fertigstellungsgrad", "einstufungsgrad", "buchung_id", "budget", "created_at") VALUES(1, 'Testprojekt', '2009-06-16 19:33:03', 0, 0, NULL, 1000.0, '2009-06-16 19:33:03')
---
  def create
    @projekt = Projekt.new(params[:projekt])

    respond_to do |format|
      if @projekt.save

SELECT * FROM "projekts" WHERE ("projekts"."id" = 1)
UPDATE "projekts" SET "fertigstellungsgrad" = 50, "updated_at" = '2009-06-28 15:31:41', "einstufungsgrad" = 30 WHERE "id" = 1
---
  def update
    @projekt = Projekt.find(params[:id])

    respond_to do |format|
      if @projekt.update_attributes(params[:projekt])

SELECT * FROM "projekts" WHERE ("projekts"."id" = 3)
DELETE FROM "projekts" WHERE "id" = 3
---
  def destroy
    @projekt = Projekt.find(params[:id])
    @projekt.destroy